app/views/expertises/viable_experts.html.erb

<p id="notice"><%= notice %></p>
<h1>Here are the experts in <%= @expertises.first.skill.name %> </h1>
---
SELECT  "skills".* FROM "skills" WHERE "skills"."name" = ? LIMIT ?  [["name", "python"], ["LIMIT", 1]]