app/controllers/experts_controller.rb

SELECT "experts".* FROM "experts"
---
  def index
    @experts = Expert.all

SELECT  "experts".* FROM "experts" WHERE "experts"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def load_expert_form
    @expert_id = params[:expert_id]
    @expert = Expert.find_by_id(@expert_id)