app/controllers/expertises_controller.rb

  def index
    @expertises = Expertise.all
---
SELECT "expertises".* FROM "expertises"

    def set_expertise
      @expertise = Expertise.find(params[:id])
---
SELECT  "expertises".* FROM "expertises" WHERE "expertises"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]