app/controllers/questions_controller.rb

  def search
    @q = params[:q]
    skill = Skill.find_by_name(@q)
    if skill.nil?
      render "expertises/no_viable_experts"
    else
      @expertises = Expertise.where(skill_id: skill["id"])
---
SELECT  "skills".* FROM "skills" WHERE "skills"."name" = ? LIMIT ?  [["name", "hello"], ["LIMIT", 1]]
SELECT  "expertises".* FROM "expertises" WHERE "expertises"."skill_id" = ? ORDER BY "expertises"."id" ASC LIMIT ?  [["skill_id", 13], ["LIMIT", 1]]